---
kind: method
id: M:Autodesk.Revit.DB.ExternalGeometryId.GetHashCode
source: html/4fe7a16f-8517-27fe-e02e-a442a3a2a502.htm
---
# Autodesk.Revit.DB.ExternalGeometryId.GetHashCode Method

Gets the hash code.

## Syntax (C#)
```csharp
public override int GetHashCode()
```